In [2]:
# Series have access labels like dictionaries
import pandas as pd
import numpy as np
my_data = [10,20,30]
labels = ['a','b','c']
# index as labes that can access the data
pd.Series(data = my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [4]:
dic1 = {'a':100, 'b':200, 'c':300}
pd.Series(dic1)

a    100
b    200
c    300
dtype: int64

In [8]:
# Series can hold list, dictionaries, functions, array etc(different object types)
# Pandas uses thes index values structure for fast lookups just like hashtables

# series = pd.Series(data, indexes)
series1 = pd.Series([3,6,12,4],['Nigeria', 'Ghana', 'Ivory Coast', 'Liberia'])
series2 = pd.Series([4,6,8,10], ['Nigeria', 'Tunisia', 'Liberia', 'Ivory Coast'])
series1 + series2

Ghana           NaN
Ivory Coast    22.0
Liberia        12.0
Nigeria         7.0
Tunisia         NaN
dtype: float64

In [14]:
# Dataframes: It is a bunch of series that share same index
from numpy.random import randn
# this ensures that the random generator produces same number anytime it is run
np.random.seed(101)
# df = pd.DataFrame(randn(row_number, col_number), [index], [series])
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X', 'Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
# df[column name or series]
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
type(df['W'])

pandas.core.series.Series

In [17]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [20]:
df['A'] = df['W'] + df['X']

In [21]:
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [23]:
df.drop('Z',axis=1)

          W         X         Y         A
A  2.706850  0.628133  0.907969  3.334983
B  0.651118 -0.319318 -0.848077  0.331800
C -2.018168  0.740122  0.528813 -1.278046
D  0.188695 -0.758872 -0.933237 -0.570177
E  0.190794  1.978757  2.605967  2.169552

In [24]:
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [25]:
# Since we can access deleted or dropped series, pandas requires another arg inplace=True.
# This tells pandas to permanently delete the series in the dataframe
df.drop('Z', axis=1, inplace=True)
df

          W         X         Y         A
A  2.706850  0.628133  0.907969  3.334983
B  0.651118 -0.319318 -0.848077  0.331800
C -2.018168  0.740122  0.528813 -1.278046
D  0.188695 -0.758872 -0.933237 -0.570177
E  0.190794  1.978757  2.605967  2.169552

In [27]:
df.drop('E', axis=0)

          W         X         Y         A
A  2.706850  0.628133  0.907969  3.334983
B  0.651118 -0.319318 -0.848077  0.331800
C -2.018168  0.740122  0.528813 -1.278046
D  0.188695 -0.758872 -0.933237 -0.570177

In [30]:
df.drop('E', axis=0, inplace=True)

KeyError: "['E'] not found in axis"

In [29]:
df

          W         X         Y         A
A  2.706850  0.628133  0.907969  3.334983
B  0.651118 -0.319318 -0.848077  0.331800
C -2.018168  0.740122  0.528813 -1.278046
D  0.188695 -0.758872 -0.933237 -0.570177

In [33]:
# select rows requires loc method. Using this methods, the rows can be described as series
df.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
A   -0.570177
Name: D, dtype: float64

In [34]:
# iloc method uses the index based location to find the rows
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
A   -1.278046
Name: C, dtype: float64

In [35]:
# To finc some specific values in the row and columns
# df.loc(rows,column)
df.loc['A','W']

2.706849839399938

In [37]:
# find multiples separate values in the series
# df.loc9[[rows], [columns]]
df.loc[['A','B'], ['Y','W']]

          Y         W
A  0.907969  2.706850
B -0.848077  0.651118

In [38]:
df.loc[['B', 'A', 'C'],['W', 'X', 'Y']]

          W         X         Y
B  0.651118 -0.319318 -0.848077
A  2.706850  0.628133  0.907969
C -2.018168  0.740122  0.528813

In [40]:
df[df>0]

          W         X         Y         A
A  2.706850  0.628133  0.907969  3.334983
B  0.651118       NaN       NaN  0.331800
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN       NaN

In [41]:
df[df['W'] > 0]

          W         X         Y         A
A  2.706850  0.628133  0.907969  3.334983
B  0.651118 -0.319318 -0.848077  0.331800
D  0.188695 -0.758872 -0.933237 -0.570177

In [1]:
df[df['W'] > 0] and df[df['A'] > 0]

NameError: name 'df' is not defined

In [6]:
# NEW DAY
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)
dfr = pd.DataFrame(randn(6,5), ['A', 'B', 'C', 'D', 'E', 'F'], ['U', 'V', 'W', 'Y', 'Z'])
dfr

          U         V         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [8]:
dfr['AZ'] = dfr['V'] + dfr['Y']
dfr

          U         V         W         Y         Z        AZ
A  2.706850  0.628133  0.907969  0.503826  0.651118  1.131958
B -0.319318 -0.848077  0.605965 -2.018168  0.740122 -2.866245
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237 -1.347873
D  0.955057  0.190794  1.978757  2.605967  0.683509  2.796762
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841  0.534604
F  0.390528  0.166905  0.184502  0.807706  0.072960  0.974611

In [9]:
dfr.drop('AZ', axis=1, inplace=True)
dfr

          U         V         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [19]:
# return series whose value is greater than V but falls in the W class
dfr[dfr['V'] > 0][['W', 'Y']]

          W         Y
A  0.907969  0.503826
D  1.978757  2.605967
E -1.706086 -1.159119
F  0.184502  0.807706

In [21]:
# the ampersand works to truthy validation for multiple conditions cos 'and' operators works for single Booleans. 
dfr[(dfr['V'] > 0) & (dfr['Y'] < 0)]

          U         V         W         Y         Z
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [25]:

dfr[(dfr['V'] > 0) | (dfr['Y'] > 0)]

          U         V         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [26]:
# inplace property will make the output permanent
dfr.reset_index()

  index         U         V         W         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826  0.651118
1     B -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     D  0.955057  0.190794  1.978757  2.605967  0.683509
4     E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
5     F  0.390528  0.166905  0.184502  0.807706  0.072960

In [27]:
dfr

          U         V         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [28]:
new_index = 'AN DT LG ZM EN IM '.split()
dfr['States'] = new_index
dfr

          U         V         W         Y         Z States
A  2.706850  0.628133  0.907969  0.503826  0.651118     AN
B -0.319318 -0.848077  0.605965 -2.018168  0.740122     DT
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237     LG
D  0.955057  0.190794  1.978757  2.605967  0.683509     ZM
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841     EN
F  0.390528  0.166905  0.184502  0.807706  0.072960     IM

In [29]:
dfr.set_index('States')

               U         V         W         Y         Z
States
AN      2.706850  0.628133  0.907969  0.503826  0.651118
DT     -0.319318 -0.848077  0.605965 -2.018168  0.740122
LG      0.528813 -0.589001  0.188695 -0.758872 -0.933237
ZM      0.955057  0.190794  1.978757  2.605967  0.683509
EN      0.302665  1.693723 -1.706086 -1.159119 -0.134841
IM      0.390528  0.166905  0.184502  0.807706  0.072960

In [35]:
# MULTI INDEX AND HIERARCHY
outside = [ 'A1','A1','A1', 'A2', 'A2', 'A2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

df = pd.DataFrame(randn(6,2), hier_index,['A', 'B'])
df

             A         B
A1 1  0.638787  0.329646
   2 -0.497104 -0.754070
   3 -0.943406  0.484752
A2 1 -0.116773  1.901755
   2  0.238127  1.996652
   3 -0.993263  0.196800

In [38]:
df.loc['A1']['A']

1    0.638787
2   -0.497104
3   -0.943406
Name: A, dtype: float64

In [41]:
df.iloc[0]

A    0.638787
B    0.329646
Name: (A1, 1), dtype: float64

In [42]:
df.index.names = ['Groups', 'Num']

In [43]:
df

                   A         B
Groups Num
A1     1    0.638787  0.329646
       2   -0.497104 -0.754070
       3   -0.943406  0.484752
A2     1   -0.116773  1.901755
       2    0.238127  1.996652
       3   -0.993263  0.196800

In [44]:
df.loc['A1'].loc[2]['B']

-0.7540697010400628

In [47]:
df.iloc[0]

A    0.638787
B    0.329646
Name: (A1, 1), dtype: float64

In [52]:
# cross sections
df.xs(1,level='Num')

               A         B
Groups
A1      0.638787  0.329646
A2     -0.116773  1.901755

In [59]:
# Pandas missing data
d = {'A':[1,2,np.nan], 'B':[4,5,np.nan], 'C':[np.nan,4,5]}
df = pd.DataFrame(d)
df

     A    B    C
0  1.0  4.0  NaN
1  2.0  5.0  4.0
2  NaN  NaN  5.0

In [60]:
# drops any rows with missing values, the axis = 0, meaning operation occurs along the rows
df.dropna()

     A    B    C
1  2.0  5.0  4.0

In [61]:
# drops columns with a null value
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [63]:
# drop any row with 2 or more nan
df.dropna(thresh=2)

     A    B    C
0  1.0  4.0  NaN
1  2.0  5.0  4.0

In [64]:
# df.fillna replaces missing data sets
df.fillna(value="Filled")

        A       B       C
0     1.0     4.0  Filled
1     2.0     5.0     4.0
2  Filled  Filled     5.0

In [66]:
# fill in with mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [69]:
# GroupBy
data = {
    'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person':['Sam', 'George', 'Isreal', 'Ade', 'Rotimi', 'Leah'],
    'Sales':[200,150,490,320,150,500]
}
df = pd.DataFrame(data,[1,2,3,4,5,6])
df

  Company  Person  Sales
1    GOOG     Sam    200
2    GOOG  George    150
3    MSFT  Isreal    490
4    MSFT     Ade    320
5      FB  Rotimi    150
6      FB    Leah    500

In [75]:
# numeric_only = True means that only columns that contains numbers
df_comp = df.groupby('Company')
df_comp.mean(numeric_only=True)

         Sales
Company
FB       325.0
GOOG     175.0
MSFT     405.0

In [77]:
df_comp.sum(numeric_only=True)

         Sales
Company
FB         650
GOOG       350
MSFT       810

In [78]:
df_comp.std(numeric_only=True)

              Sales
Company
FB       247.487373
GOOG      35.355339
MSFT     120.208153

In [79]:
df_comp.std(numeric_only=True).loc['FB']

Sales    247.487373
Name: FB, dtype: float64

In [81]:
df.groupby('Company').max()

         Person  Sales
Company
FB       Rotimi    500
GOOG        Sam    200
MSFT     Isreal    490

In [84]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     175.000000
       std       35.355339
       min      150.000000
       25%      162.500000
       50%      175.000000
       75%      187.500000
       max      200.000000
Name: GOOG, dtype: float64

In [85]:
# MERGING, JOINING AND CONCATENATING
df1 = pd.DataFrame({
    "A": ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C':['C0', 'C1', 'C2', 'C3'],
}, index=[0,1,2,3])

df2 = pd.DataFrame({
    "A": ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C':['C4', 'C5', 'C6', 'C7'],
}, index=[4,5,6,7])

df3 = pd.DataFrame({
    "A": ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C':['C8', 'C9', 'C10', 'C11'],
}, index=[8,9,10,11])

df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [87]:
pd.concat([df1,df2,df3])

      A    B    C
0    A0   B0   C0
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [89]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

In [118]:
left = pd.DataFrame({
    'key' : ['K0', 'K1', 'K2', 'K3'],
    'A':['A0', 'A1', 'A2', 'A3'],
    'B':['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key' : ['K0', 'K1', 'K2', 'K3'],
    'C':['C0', 'C1', 'C2', 'C3'],
    'D':['D0', 'D1', 'D2', 'D3']
})

# pd.concat([left,right], axis=1)
merged_df = pd.merge(left, right, left_index=True, right_index=True, suffixes=('_left', '_right'))
# column_order = ['key', 'left', 'right'] 
# merged_df = merged_df.reindex(columns=column_order)
merged_df

  key_left   A   B key_right   C   D
0       K0  A0  B0        K0  C0  D0
1       K1  A1  B1        K1  C1  D1
2       K2  A2  B2        K2  C2  D2
3       K3  A3  B3        K3  C3  D3

In [92]:
# merge function allows the merge of dataframes together using a similar logic as SQL
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [97]:
pd.merge(left,right,how="inner", on="key")

KeyError: 'key'

In [112]:
left = pd.DataFrame({
    'key1' : ['K0', 'K0', 'K1', 'K2'],
    'key2' : ['K0', 'K1', 'K0', 'K1'],
    'A':['A0', 'A1', 'A2', 'A3'],
    'B':['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key1' : ['K0', 'K1', 'K1', 'K2'],
    'key2' : ['K0', 'K0', 'K0', 'K0'],
    'C':['C0', 'C1', 'C2', 'C3'],
    'D':['D0', 'D1', 'D2', 'D3']
})

pd.merge(left,right,left_index=True, right_index=True, suffixes=('_left', '_right'))

   key  value_left  value_right
0  NaN         NaN          NaN
1  NaN         NaN          NaN
2  NaN         NaN          NaN
3  NaN         NaN          NaN

In [122]:
# create two sample dataframes with a common key
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value2': [4, 5, 6]})

# merge the dataframes on the 'key' column
merged_df = pd.merge(df1, df2, on='key')

# retrieve the list of column names in the merged dataframe
column_list = merged_df.columns.tolist()

# move the 'key' column to the middle of the column list
key_index = column_list.index('key')
column_list.insert(len(column_list) // 2, column_list.pop(key_index))

# reorder the columns of the merged dataframe using the modified column list
merged_df = merged_df.reindex(columns=column_list)

merged_df

   value1 key  value2
0       2   B       4
1       3   C       5

In [128]:
left = pd.DataFrame({
    'key1' : ['K0', 'K0', 'K1', 'K2'],
    'A':['A0', 'A1', 'A2', 'A3'],
    'B':['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key1' : ['K0', 'K1', 'K1', 'K2'],
    'C':['C0', 'C1', 'C2', 'C3'],
    'D':['D0', 'D1', 'D2', 'D3']
})

merged_df = pd.merge(left,right,on='key1')
col_list = merged_df.columns.tolist()
key_index = col_list.index('key1')

col_list.insert(len(col_list)//2, col_list.pop(key_index))
merged_df = merged_df.reindex(columns = col_list)
merged_df

    A   B key1   C   D
0  A0  B0   K0  C0  D0
1  A1  B1   K0  C0  D0
2  A2  B2   K1  C1  D1
3  A2  B2   K1  C2  D2
4  A3  B3   K2  C3  D3

In [146]:
left = pd.DataFrame({
    'key1' : ['K0', 'K0', 'K1', 'K2'],
    'key2' : ['K0', 'K1', 'K0', 'K1'],
    'A':['A0', 'A1', 'A2', 'A3'],
    'B':['B0', 'B1', 'B2', 'B3']
})

right = pd.DataFrame({
    'key1' : ['K0', 'K1', 'K1', 'K2'],
    'key2' : ['K0', 'K0', 'K0', 'K0'],
    'C':['C0', 'C1', 'C2', 'C3'],
    'D':['D0', 'D1', 'D2', 'D3']
})

merged_df = pd.merge(left,right,on=['key1', 'key2'], how="outer")
col_list = merged_df.columns.tolist()

key1_index = col_list.index('key1')

col_list.insert(len(col_list)//2, col_list.pop(key1_index))
key2_index = col_list.index('key2')

col_list.insert(len(col_list)//2 , col_list.pop(key2_index))
merged_df = merged_df.reindex(columns = col_list)
merged_df

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [155]:
# JOIN method: Its an intersection of dataframes to see where they potentially share datasets
left = pd.DataFrame({
        'A':['A0', 'A1', 'A2'],
        'B':['B0', 'B1', 'B2']
    },
    index = ['K0', 'K1', 'K2']
)

right = pd.DataFrame({
        'C':['C0', 'C1', 'C2'],
        'D':['D0', 'D1', 'D2']
    },
    index = ['K0', 'K2', 'K3']
)
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [152]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [157]:
right.join(left,how="inner")

     C   D   A   B
K0  C0  D0  A0  B0
K2  C1  D1  A2  B2

In [162]:
# operations
pd_list = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
# unique method returns values in the column
pd_list['col2'].unique()

# nunique returns the length of the array
pd_list['col2'].nunique()

# len method also returns the length of the array
len(pd_list['col2'].unique())

3

In [164]:
# to know how many times each unique value showed up in the column
pd_list['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [165]:
pd

In [167]:
pd_list[(pd_list['col1'] > 2) & (pd_list['col2'] >444)]

   col1  col2 col3
2     3   666  ghi

In [168]:
# To apply a function to the values of a column
def sqrt(num):
    return num **2

pd_list['col1'].apply(sqrt)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [169]:
pd_list['col2'].sum()

2109

In [171]:
pd_list['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [172]:
pd_list['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [174]:
pd_list.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [175]:
pd_list.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [176]:
pd_list.columns.to_list()

['col1', 'col2', 'col3']

In [177]:
pd_list.index

RangeIndex(start=0, stop=4, step=1)

In [178]:
# sorting the columns
pd_list.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [179]:
 pd_list.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [181]:
df = pd.DataFrame({
    'A':['foo', 'bar', 'foo', 'foo', 'bar'],
    'B' : ['one', 'one', 'two', 'one', 'two'],
    'C': [1,3,2,1,2],
    'D':['x', 'x', 'y','y','x']
})
df

     A    B  C  D
0  foo  one  1  x
1  bar  one  3  x
2  foo  two  2  y
3  foo  one  1  y
4  bar  two  2  x

In [182]:
#  A and B are the indices, D is the column and C gives the values for the table
df.pivot_table(values = 'C', index=['A', 'B'], columns=['D'])

D          x    y
A   B
bar one  3.0  NaN
    two  2.0  NaN
foo one  1.0  1.0
    two  NaN  2.0

In [9]:
# Data input and output
# Read and write data on other sources eg CSV, Excel, HTML and SQL
import pandas as pd
import csv

# define the data
data = [
    ['Name', 'Age', 'Gender'],
    ['John', '30', 'Male'],
    ['Jane', '25', 'Female'],
    ['Bob', '45', 'Male'],
]

# open the file in write mode
with open('mydata.csv', mode='w', newline='') as file:

    # create a writer object
    writer = csv.writer(file)

    # write the data to the file
    for row in data:
        writer.writerow(row)

df = pd.read_csv('mydata.csv')
df

   Name  Age  Gender
0  John   30    Male
1  Jane   25  Female
2   Bob   45    Male

In [10]:
# create a new csv file from an old one
df.to_csv('my_output.csv', index=False)
df = pd.read_csv('my_output.csv')
df

   Name  Age  Gender
0  John   30    Male
1  Jane   25  Female
2   Bob   45    Male

In [7]:
import pandas as pd
import openpyxl

workbook = openpyxl.load_workbook(filename='my_excel.xlsx')

# Select the sheet that you want to read
sheet = workbook['Sheet1']
# Iterate over the rows in the sheet and append them to the rows list
for row in sheet.iter_rows(values_only=True):
    rows.append(row)

# Create a Pandas DataFrame from the rows list
df = pd.DataFrame(rows[1:], columns=rows[0])

# Display the DataFrame
print(df.head())

# df = pd.read_excel('my_excel.xlsx')
# df

ModuleNotFoundError: No module named 'openpyxl'

In [2]:
df.to_excel('excel_sample.xlsx', sheet_name="NewSheet")

AttributeError: 'list' object has no attribute 'to_excel'

In [5]:
pd.read_excel('my_excel.xlsx')

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [7]:
import pandas as pd
# data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/',parser='lxml')
# df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
df

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                       Signature Bank           New York      NY     57053
 1                  Silicon Valley Bank        Santa Clara      CA     24735
 2                    Almena State Bank             Almena      KS     15426
 3           First City Bank of Florida  Fort Walton Beach      FL     16748
 4                 The First State Bank      Barboursville      WV     14361
 ..                                 ...                ...     ...       ...
 560                 Superior Bank, FSB           Hinsdale      IL     32646
 561                Malta National Bank              Malta      OH      6629
 562    First Alliance Bank & Trust Co.         Manchester      NH     34264
 563  National State Bank of Metropolis         Metropolis      IL      3815
 564                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0            Signature Bridge Bank, N.A.      March 12, 2023     10540
 1       Silicon Valley Bridge Bank, N.A.      March 10, 2023     10539
 2                            Equity Bank    October 23, 2020     10538
 3              United Fidelity Bank, fsb    October 16, 2020     10537
 4                         MVB Bank, Inc.       April 3, 2020     10536
 ..                                   ...                 ...       ...
 560                Superior Federal, FSB       July 27, 2001      6004
 561                    North Valley Bank         May 3, 2001      4648
 562  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 563              Banterra Bank of Marion   December 14, 2000      4646
 564                   Bank of the Orient    October 13, 2000      4645

 [565 rows x 7 columns]]

In [11]:
df[0][:20]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Signature Bank,New York,NY,57053,"Signature Bridge Bank, N.A.","March 12, 2023",10540
1,Silicon Valley Bank,Santa Clara,CA,24735,"Silicon Valley Bridge Bank, N.A.","March 10, 2023",10539
2,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
3,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
4,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
5,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
6,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
7,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019",10533
8,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
9,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019",10531
10,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017",10530
11,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017",10529
12,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
13,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
14,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017",10526
15,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017",10525
16,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017",10524
17,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523
18,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016",10522
19,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016",10521

In [20]:
# sql works with pandas

from sqlalchemy import create_engine
df= pd.read_excel('my_excel.xlsx',index_col=0, header=0)

engine = create_engine('sqlite:///:memory:')
df.to_sql('my_table', engine)

3

In [21]:
sqldf = pd.read_sql('my_table', con=engine)
sqldf

AttributeError: 'OptionEngine' object has no attribute 'execute'

In [348]:
import pandas as pd
sal = pd.read_csv('Salaries/salaries.csv')
sal.head()

C:\Users\pc\AppData\Local\Temp\ipykernel_14748\2639608621.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries/salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [128]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [139]:
import numpy as np
sal_values = sal['BasePay'].values

new_sal = []
for strings in sal_values:
    if(strings == 'Not Provided'):
        new_sal
    else:
        new_sal.append(float(strings))
# print(type(new_sal[148000]))
arr_mean = np.mean(new_sal[:81000])
arr_mean

70978.08107493827

In [153]:
overtime = sal['OvertimePay'].values

new_sal = []
for strings in overtime:
    if(strings == 'Not Provided'):
        new_sal
    else:
        new_sal.append(float(strings))
np.max(new_sal)

245131.88

In [154]:
sal[sal['EmployeeName'] == "JOSEPH DRISCOLL"]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [155]:
sal[sal['EmployeeName'] == "JOSEPH DRISCOLL"]['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [162]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [164]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [206]:
# df[df['W'] > 0]
def basePay(sal, year):
    numbers = sal[sal['Year'] == year]['BasePay'].values
    new_sal = []
    for num in numbers:
        if(type(num) == str):
            new_sal
        else:
            new_sal.append(float(num))
    return np.mean(new_sal)

In [202]:
base_amt = basePay(sal, 2011)
print(f'The base pay for 2011 is {base_amt}')

The base pay for 2011 is 63595.95651677314

In [203]:
base_amt = basePay(sal, 2012)
print(f'The base pay for 2011 is {base_amt}')

The base pay for 2011 is 65436.40685742263

In [204]:
base_amt = basePay(sal, 2013)
print(f'The base pay for 2011 is {base_amt}')

The base pay for 2011 is nan

In [205]:
base_amt = basePay(sal, 2014)
print(f'The base pay for 2011 is {base_amt}')

The base pay for 2011 is 98516.40637797577

In [276]:
import math
numbers = sal[sal['Year'] == 2013]['BasePay'].values
new_total = []
for x in numbers:
    if(not math.isnan(x)):
        new_total.append(x)
length = len(new_total)

mean = sum(new_total)/length
mean

69630.0302164812

In [293]:
def basePay(sal, year):
    numbers = sal[sal['Year'] == year]['BasePay'].values
    new_total = []
    for x in numbers:
        if(type(x) == str):
            new_total
        elif(not math.isnan(x)):
            new_total.append(x)
        else:
            new_total
    length = len(new_total)

    mean = sum(new_total)/length
    return mean

basePay(sal, 2014)

98516.40637796959

In [297]:
sal = pd.read_csv('Salaries/salaries.csv', low_memory=False)
sal['JobTitle'].nunique()

2159

In [298]:
sal['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [308]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [333]:
new_value = sal[sal['Year'] == 2013][['JobTitle', 'EmployeeName']]
new_val = sum(new_value['JobTitle'].value_counts() == 1)
new_val

202

In [340]:
new_v = sal['JobTitle'].values
val_wrapper = []
for val in new_v:
    if('chief' in val.lower().split()):
        val_wrapper.append(val)
len(val_wrapper)

477

In [347]:
sal['total_len'] = sal['JobTitle'].apply(len)
sal[['total_len', 'TotalPayBenefits']].corr()

                  total_len  TotalPayBenefits
total_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

In [349]:
ecomm = pd.read_csv("Salaries/Ecommerce.csv")
ecomm.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [350]:
ecomm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [354]:
ecomm['Purchase Price'].values.mean()
# or ecomm['Purchase Price'].mean()

50.347302

In [355]:
max_price = ecomm['Purchase Price'].values.max()

In [356]:
max_price

99.99

In [357]:
min_price = ecomm['Purchase Price'].values.min()
min_price

0.0

In [367]:
len(ecomm[ecomm['Language'] == 'en'])

# OR

# ecomm_arr = ecomm['Language'].values

# new_arr = []
# for lang in ecomm_arr:
#     if(lang == 'en'):
#         new_arr.append(lang)
# len(new_arr)

1098

In [369]:
len(ecomm[ecomm['Job'] == 'Lawyer'])

30

In [372]:
am_length = len(ecomm[ecomm['AM or PM'] == 'AM'])
pm_length = len(ecomm[ecomm['AM or PM'] == 'PM'])

In [373]:
am_length

4932

In [374]:
pm_length

5068

In [376]:
# OR 
ecomm['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [379]:
# head(5) means count the first five items in the array
ecomm['Job'].value_counts().head(5)

Interior and spatial designer    31
Lawyer                           30
Social researcher                28
Purchasing manager               27
Designer, jewellery              27
Name: Job, dtype: int64

In [385]:
ecomm[ecomm['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [390]:
ecomm[ecomm['Credit Card'] == 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [402]:
ecomm_items = ecomm[ecomm['CC Provider'] == 'American Express']
len(ecomm_items[ecomm_items['Purchase Price'] >= 95])

39

In [411]:
ecomm_val = ecomm['CC Exp Date'].values

nums = []
for val in ecomm_val:
    if(val[3:] == '25'):
        nums.append(val)
len(nums)

# OR
# sum(ecomm['CC Exp Date'].apply(lambda x: x[3:]) == '25')

1033

In [420]:
# Find yahoo and gmail from the email list
# ecomm_mails = ecomm['Email'].values

# emails = []
# for val in ecomm_mails:
#     val_index = val.index("@") + 1
#     if(val[val_index:] == "yahoo.com"):
#         emails.append(val)
#     elif(val[val_index:] == "gmail.com"):
#         emails.append(val)
#     else:
#         emails
# len(emails)

# find 5 most popular email providers
ecomm['Email'].apply(lambda x : x[x.index("@") + 1 :]).value_counts().head(5)

# or
# ecom['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64